action:close
action:flip
action:lift
action:lower
action:move
action:open
action:pick
action:pick_up
action:place
action:place_on
action:pour
action:pull
action:push
action:put
action:put_down
action:remove
action:rotate
action:slide
action:stack
action:take
action:turn
attr:back
attr:big
attr:black
attr:blue
attr:bottom
attr:brown
attr:center
attr:circular
attr:close
attr:croissant
attr:cylindrical
attr:eggplant
attr:empty
attr:far
attr:faucet
attr:flip
attr:front
attr:gray
attr:green
attr:grey
attr:half
attr:hot
attr:laundry
attr:left
attr:light
attr:little
attr:long
attr:low
attr:metallic
attr:middle
attr:near
attr:next
attr:open
attr:opposite
attr:orange
attr:other
attr:pink
attr:plastic
attr:purple
attr:put
attr:rectangular
attr:red
attr:right
attr:same
attr:silver
attr:small
attr:square
attr:stainless
attr:sweet
attr:tall
attr:top
attr:topple
attr:upper
attr:upright
attr:vertical
attr:violet
attr:white
attr:wooden
attr:yellow
obj:allen
obj:almond
obj:animal
obj:apple
obj:arc
obj:arch
obj:arm
obj:back
obj:bag
obj:ball
obj:banana
obj:bar
obj:basil
obj:basket
obj:baster
obj:bear
obj:beet
obj:bell
obj:bit
obj:blender
obj:block
obj:blue
obj:blueberry
obj:board
obj:book
obj:bottle
obj:bottom
obj:bowl
obj:box
obj:bread
obj:brick
obj:broccoli
obj:brush
obj:bucket
obj:bunny
obj:burner
obj:cabinet
obj:cake
obj:can
obj:cap
obj:capsicum
obj:cardboard
obj:carrot
obj:cauliflower
obj:center
obj:centre
obj:cheese
obj:chicken
obj:chili
obj:chocolate
obj:circle
obj:cloth
obj:clothe
obj:clothing
obj:colander
obj:color
obj:cone
obj:container
obj:cooker
obj:cooking
obj:cooktop
obj:corn
obj:corncob
obj:corner
obj:counter
obj:cover
obj:cream
obj:cube
obj:cuboid
obj:cucumber
obj:cup
obj:cutter
obj:cylinder
obj:desk
obj:detergent
obj:direction
obj:dish
obj:dog
obj:doll
obj:drainer
obj:draw
obj:drawer
obj:drumstick
obj:dryer
obj:duck
obj:edge
obj:effector
obj:egg
obj:eggplant
obj:elephant
obj:end
obj:fabric
obj:fence
obj:figure
obj:fish
obj:flap
obj:floor
obj:food
obj:fork
obj:fridge
obj:front
obj:fruit
obj:fry
obj:gauche
obj:glass
obj:glue
obj:good
obj:grape
obj:half
obj:hand
obj:handle
obj:holder
obj:hole
obj:ice
obj:image
obj:item
obj:jar
obj:key
obj:kitchen
obj:knife
obj:knob
obj:label
obj:ladle
obj:large4fbox
obj:left
obj:leg
obj:lemon
obj:lid
obj:lift
obj:machine
obj:maroon
obj:meat
obj:metal
obj:microwave
obj:middle
obj:mouse
obj:move
obj:mushroom
obj:napkin
obj:object
obj:objet
obj:one
obj:onion
obj:ontop
obj:orange
obj:oven
obj:pan
obj:part
obj:pawn
obj:pear
obj:pen
obj:pepper
obj:pickle
obj:piece
obj:pile
obj:pineapple
obj:place
obj:plastic
obj:plate
obj:plus
obj:position
obj:pot
obj:potato
obj:pour
obj:pumpkin
obj:rabbit
obj:rack
obj:rag
obj:rectangle
obj:red
obj:redcube
obj:right
obj:rigth
obj:ring
obj:robot
obj:roll
obj:salmon
obj:salt
obj:sauce
obj:saucepan
obj:sausage
obj:scissor
obj:scoop
obj:shaker
obj:shape
obj:shelf
obj:side
obj:silver
obj:sink
obj:slice
obj:slide
obj:sliver
obj:space
obj:spatula
obj:sponge
obj:spoon
obj:square
obj:squash
obj:srewdriver
obj:steel
obj:stick
obj:stove
obj:stovetop
obj:strainer
obj:strawberry
obj:stuff
obj:stuffedduck
obj:stuffedpig
obj:stuffedrabbit
obj:surface
obj:sushi
obj:switch
obj:table
obj:thing
obj:tiger
obj:tin
obj:tomato
obj:top
obj:topple
obj:towel
obj:tower
obj:toy
obj:transition
obj:tray
obj:triangle
obj:unfold
obj:upright
obj:vegetable
obj:vessel
obj:violet
obj:wall
obj:washer
obj:washing
obj:wedge
obj:wing
obj:wipe
obj:wok
obj:wood
obj:yellow
obj:zip
obj:zipper
spatial:above
spatial:back
spatial:below
spatial:beside
spatial:bottom
spatial:front
spatial:in
spatial:inside
spatial:into
spatial:left
spatial:near
spatial:next
spatial:off
spatial:on
spatial:onto
spatial:outside
spatial:over
spatial:right
spatial:top
spatial:under
verb:back
verb:bottom
verb:bring
verb:can
verb:center
verb:close
verb:cover
verb:cut
verb:drag
verb:drop
verb:dry
verb:fold
verb:front
verb:fry
verb:get
verb:grab
verb:handle
verb:hold
verb:keep
verb:leave
verb:left
verb:lift
verb:load
verb:lower
verb:make
verb:measure
verb:moove
verb:move
verb:object
verb:open
verb:oven
verb:pan
verb:pear
verb:pick
verb:pickup
verb:place
verb:point
verb:pull
verb:push
verb:put
verb:reach
verb:remove
verb:rotate
verb:set
verb:sink
verb:slide
verb:spoon
verb:squash
verb:stand
verb:strawberry
verb:stuff
verb:sweep
verb:take
verb:top
verb:touch
verb:towel
verb:transfer
verb:tray
verb:turn
verb:unfold
verb:unzip
verb:use
verb:wipe
